# Part 1: Creating a database
Save all of your instructions in a script file - you will submit this file on Gnomio and github.

**Create a database called “Umuzi”.**

CREATE DATABASE UMUZI;

**Create the following tables in the Umuzi database:**

    Customers
    Employees
    Orders
    Payments
    Products

/* Customers */
CREATE TABLE Customers(
        customerid      SERIAL PRIMARY KEY,
        firstname       VARCHAR (50),
        lastname        VARCHAR(50),
        gender          VARCHAR,
        addresses       VARCHAR(200),
        phone           BIGINT,
        email           VARCHAR(100),
        city            VARCHAR(20),
        country         VARCHAR(50)
);


/* Employees */
CREATE TABLE Employees(
        employeeid     SERIAL PRIMARY KEY ,
        firstname      VARCHAR(50),
        lastname       VARCHAR(50),
        email          VARCHAR(100),
        jobTitle       VARCHAR(50)
);


/* Payments */
CREATE TABLE Payments(
        customerId     INT REFERENCES Customers(CustomerId),
        paymentId      SERIAL PRIMARY KEY,
        paymentDate    DATE,
        amount         DECIMAL

);

CREATE TABLE products(
        productId     SERIAL primary key,
        productName   VARCHAR (50),
        descriptions  VARCHAR(500),
        buyPrice      DECIMAL
);

/* Orders */
CREATE TABLE Orders(
        orderId           SERIAL PRIMARY KEY ,
        productId         INT REFERENCES Products(ProductId),
        paymentId         INT REFERENCES Payments(PaymentId),
        employeeId        INT REFERENCES Employees(EmployeeId),
        dateRequired      DATE,
        dateShipped       DATE,
        parcelStatus      VARCHAR(100)

);

**INSERT the records in the tables below into the table you created in step 2.**

In [21]:
INSERT INTO Customers(customerid,firstname,lastname,gender,addresses,phone,email,city,country)
                  VALUES(1, 'John','Hibert','Male','284 chaucer st',+2784789657,'john@gmail.com','Johannesburg','South'),
                        (2, 'Thando','Sithole','Female','240 Sect 1',+27794445584,'thando@gmail.com','Cape Town','South Africa'),
                        (3, 'Leon','Glen','Male','81 Everton Rd,Gillits',+27820832830,'Leon@gmail.com','Durban','South Africa'),
                        (4, 'Charl','Muller','Mal','290A Dorset Ecke',+44856872553,'Charl.muller@yahoo.com','Berlin','Germany'),
                        (5, 'Julia','Stein','Female','2 Wernerring',+448672445058,'Js234@yahoo.com','Frankfurt','Germany');
                    
INSERT INTO Employees(employeeId,firstname,lastname,email,jobtitle)
            VALUES(1,'Kani','Matthew','mat@gmail.com','Manager'),
                  (2,'Lesly','Cronje','LesC@gmail.com','Clerk'),
                  (3,'Gideon','Maduku','m@gmail.com','Accountant');
            
            
INSERT INTO Payments(customerId,paymentDate,amount)
            VALUES(1,'01-09-2018',150.75),
                  (5,'03-09-2018',150.75),
                  (4,'03-09-2018',700.60);
            
            
INSERT INTO PRODUCTS(productName,descriptions,buyPrice)
            VALUES('Harley Davidson Chopper','This replica features working kickstand, front suspension, gear-shift lever',150.75),
                  ('Classic Car','Turnable front wheels, steering function',550.75),
                  ('Sports car','Turnable front wheels, steering function',700.60);
            
INSERT INTO Orders(productId,paymentId,employeeId,dateRequired,dateShipped,parcelStatus)
            VALUES(1,1,2,'05-09-2018',NULL,'Not shipped'),
                  (1,2,2,'04-09-2018','03-09-2018','Shipped'),
                  (3,3,3,'06-09-2018',NULL,'Not shipped');

# Part 2: Querying a database
Save all of your instructions in a script file - you will submit this file on Gnomio and github.

**1. SELECT ALL records from table Customers.**

SELECT * FROM Customers;

**2. SELECT records only from the name column in the Customers table.**

In [ ]:
SELECT firstname FROM Customers;

**3. Show the name of the Customer whose CustomerID is 1.**

In [ ]:
SELECT firstname FROM Customers 
    WHERE CustomerID = 1;

**4. UPDATE the record for CustomerID = 1 on the Customer table so that the name is “Lerato Mabitso”.**

In [ ]:
UPDATE Customers 
    SET firstname = 'Lerato', lastname= 'Mabitso' 
    WHERE customerID = 1;

**5. DELETE the record from the Customers table for customer 2 (CustomerID = 2).**

In [ ]:
DELETE FROM Customers 
    WHERE customerid= 2;

**6. Select all unique statuses from the Orders table and get a count of the number of orders for each unique status.**

In [ ]:
SELECT COUNT(DISTINCT status) FROM Orders;

**7. Return the MAXIMUM payment made on the PAYMENTS table**

In [ ]:
SELECT MAX(amount) FROM payments;

**8. Select all customers from the “Customers” table, sorted by the “Country” column.**

In [ ]:
SELECT * FROM Customers 
    ORDER BY country;

**9. Select all products with a price BETWEEN R100 and R600**

In [ ]:
SELECT * FROM Products 
    WHERE buyPrice 
    BETWEEN 100 AND 600;

**10. Select all fields from “Customers” where country is “Germany” AND city is “Berlin”.**

In [ ]:
SELECT * FROM Customers
    WHERE country = 'Germany' 
    AND city = 'Berlin';

**11. Select all fields from “Customers” where city is “Cape Town” OR “Durban”.**

In [ ]:
SELECT * FROM Customers 
    WHERE city = 'Cape Town' 
    OR city = 'Durban';

**12. Select all records from Products where the Price is GREATER than R500.**

In [ ]:
SELECT * FROM Products 
    WHERE buyprice > 500;

**13. Return the sum of the Amounts on the Payments table.**

In [ ]:
SELECT SUM(amount) FROM payments;

**14. Count the number of shipped orders in the Orders table.**

In [ ]:
SELECT COUNT(status) FROM Orders 
    WHERE parcelStatus = 'Shipped';

**15. Return the average price of all Products, in Rands and in Dollars (assume the exchange rate is R12 to the Dollar).**

In [ ]:
SELECT AVG(buyprice) AS Rands, 
    AVG(buyprice) / 12 AS Dollars 
FROM products;

**16. Using INNER JOIN create a query that selects all Payments with Customer information.**

In [ ]:
SELECT * FROM Payments
    INNER JOIN Customers ON 
    Payments.customerid = Customers.customerid;

**17. Select all products that have turnable front wheels.**

In [ ]:
SELECT * FROM Products
    WHERE descriptions LIKE 'Turnable front wheels%';